RIOT-OS/RIOT/cpu/kinetis/include/vendor/MKE02Z4.h
/*! @name FSEC - Flash Security Register */
#define FTMRH_FSEC_SEC_MASK                      (0x3U)
#define FTMRH_FSEC_SEC_SHIFT                     (0U)
#define FTMRH_FSEC_SEC(x)                        (((uint8_t)(((uint8_t)(x)) << FTMRH_FSEC_SEC_SHIFT)) & FTMRH_FSEC_SEC_MASK)
#define FTMRH_FSEC_KEYEN_MASK                    (0xC0U)
#define FTMRH_FSEC_KEYEN_SHIFT                   (6U)
#define FTMRH_FSEC_KEYEN(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FSEC_KEYEN_SHIFT)) & FTMRH_FSEC_KEYEN_MASK)

/*! @name FCCOBIX - Flash CCOB Index Register */
#define FTMRH_FCCOBIX_CCOBIX_MASK                (0x7U)
#define FTMRH_FCCOBIX_CCOBIX_SHIFT               (0U)
#define FTMRH_FCCOBIX_CCOBIX(x)                  (((uint8_t)(((uint8_t)(x)) << FTMRH_FCCOBIX_CCOBIX_SHIFT)) & FTMRH_FCCOBIX_CCOBIX_MASK)

/*! @name FCNFG - Flash Configuration Register */
#define FTMRH_FCNFG_FSFD_MASK                    (0x1U)
#define FTMRH_FCNFG_FSFD_SHIFT                   (0U)
#define FTMRH_FCNFG_FSFD(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FCNFG_FSFD_SHIFT)) & FTMRH_FCNFG_FSFD_MASK)
#define FTMRH_FCNFG_FDFD_MASK                    (0x2U)
#define FTMRH_FCNFG_FDFD_SHIFT                   (1U)
#define FTMRH_FCNFG_FDFD(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FCNFG_FDFD_SHIFT)) & FTMRH_FCNFG_FDFD_MASK)
#define FTMRH_FCNFG_IGNSF_MASK                   (0x10U)
#define FTMRH_FCNFG_IGNSF_SHIFT                  (4U)
#define FTMRH_FCNFG_IGNSF(x)                     (((uint8_t)(((uint8_t)(x)) << FTMRH_FCNFG_IGNSF_SHIFT)) & FTMRH_FCNFG_IGNSF_MASK)
#define FTMRH_FCNFG_CCIE_MASK                    (0x80U)
#define FTMRH_FCNFG_CCIE_SHIFT                   (7U)
#define FTMRH_FCNFG_CCIE(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FCNFG_CCIE_SHIFT)) & FTMRH_FCNFG_CCIE_MASK)

/*! @name FERCNFG - Flash Error Configuration Register */
#define FTMRH_FERCNFG_SFDIE_MASK                 (0x1U)
#define FTMRH_FERCNFG_SFDIE_SHIFT                (0U)
#define FTMRH_FERCNFG_SFDIE(x)                   (((uint8_t)(((uint8_t)(x)) << FTMRH_FERCNFG_SFDIE_SHIFT)) & FTMRH_FERCNFG_SFDIE_MASK)
#define FTMRH_FERCNFG_DFDIE_MASK                 (0x2U)
#define FTMRH_FERCNFG_DFDIE_SHIFT                (1U)
#define FTMRH_FERCNFG_DFDIE(x)                   (((uint8_t)(((uint8_t)(x)) << FTMRH_FERCNFG_DFDIE_SHIFT)) & FTMRH_FERCNFG_DFDIE_MASK)

/*! @name FSTAT - Flash Status Register */
#define FTMRH_FSTAT_MGSTAT_MASK                  (0x3U)
#define FTMRH_FSTAT_MGSTAT_SHIFT                 (0U)
#define FTMRH_FSTAT_MGSTAT(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FSTAT_MGSTAT_SHIFT)) & FTMRH_FSTAT_MGSTAT_MASK)
#define FTMRH_FSTAT_MGBUSY_MASK                  (0x8U)
#define FTMRH_FSTAT_MGBUSY_SHIFT                 (3U)
#define FTMRH_FSTAT_MGBUSY(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FSTAT_MGBUSY_SHIFT)) & FTMRH_FSTAT_MGBUSY_MASK)
#define FTMRH_FSTAT_FPVIOL_MASK                  (0x10U)
#define FTMRH_FSTAT_FPVIOL_SHIFT                 (4U)
#define FTMRH_FSTAT_FPVIOL(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FSTAT_FPVIOL_SHIFT)) & FTMRH_FSTAT_FPVIOL_MASK)
#define FTMRH_FSTAT_ACCERR_MASK                  (0x20U)
#define FTMRH_FSTAT_ACCERR_SHIFT                 (5U)
#define FTMRH_FSTAT_ACCERR(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FSTAT_ACCERR_SHIFT)) & FTMRH_FSTAT_ACCERR_MASK)
#define FTMRH_FSTAT_CCIF_MASK                    (0x80U)
#define FTMRH_FSTAT_CCIF_SHIFT                   (7U)
#define FTMRH_FSTAT_CCIF(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FSTAT_CCIF_SHIFT)) & FTMRH_FSTAT_CCIF_MASK)

/*! @name FERSTAT - Flash Error Status Register */
#define FTMRH_FERSTAT_SFDIF_MASK                 (0x1U)
#define FTMRH_FERSTAT_SFDIF_SHIFT                (0U)
#define FTMRH_FERSTAT_SFDIF(x)                   (((uint8_t)(((uint8_t)(x)) << FTMRH_FERSTAT_SFDIF_SHIFT)) & FTMRH_FERSTAT_SFDIF_MASK)
#define FTMRH_FERSTAT_DFDIF_MASK                 (0x2U)
#define FTMRH_FERSTAT_DFDIF_SHIFT                (1U)
#define FTMRH_FERSTAT_DFDIF(x)                   (((uint8_t)(((uint8_t)(x)) << FTMRH_FERSTAT_DFDIF_SHIFT)) & FTMRH_FERSTAT_DFDIF_MASK)

/*! @name FPROT - Flash Protection Register */
#define FTMRH_FPROT_FPLS_MASK                    (0x3U)
#define FTMRH_FPROT_FPLS_SHIFT                   (0U)
#define FTMRH_FPROT_FPLS(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FPROT_FPLS_SHIFT)) & FTMRH_FPROT_FPLS_MASK)
#define FTMRH_FPROT_FPLDIS_MASK                  (0x4U)
#define FTMRH_FPROT_FPLDIS_SHIFT                 (2U)
#define FTMRH_FPROT_FPLDIS(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FPROT_FPLDIS_SHIFT)) & FTMRH_FPROT_FPLDIS_MASK)
#define FTMRH_FPROT_FPHS_MASK                    (0x18U)
#define FTMRH_FPROT_FPHS_SHIFT                   (3U)
#define FTMRH_FPROT_FPHS(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FPROT_FPHS_SHIFT)) & FTMRH_FPROT_FPHS_MASK)
#define FTMRH_FPROT_FPHDIS_MASK                  (0x20U)
#define FTMRH_FPROT_FPHDIS_SHIFT                 (5U)
#define FTMRH_FPROT_FPHDIS(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FPROT_FPHDIS_SHIFT)) & FTMRH_FPROT_FPHDIS_MASK)
#define FTMRH_FPROT_RNV6_MASK                    (0x40U)
#define FTMRH_FPROT_RNV6_SHIFT                   (6U)
#define FTMRH_FPROT_RNV6(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_FPROT_RNV6_SHIFT)) & FTMRH_FPROT_RNV6_MASK)
#define FTMRH_FPROT_FPOPEN_MASK                  (0x80U)
#define FTMRH_FPROT_FPOPEN_SHIFT                 (7U)
#define FTMRH_FPROT_FPOPEN(x)                    (((uint8_t)(((uint8_t)(x)) << FTMRH_FPROT_FPOPEN_SHIFT)) & FTMRH_FPROT_FPOPEN_MASK)

/*! @name EEPROT - EEPROM Protection Register */
#define FTMRH_EEPROT_DPS_MASK                    (0x7U)
#define FTMRH_EEPROT_DPS_SHIFT                   (0U)
#define FTMRH_EEPROT_DPS(x)                      (((uint8_t)(((uint8_t)(x)) << FTMRH_EEPROT_DPS_SHIFT)) & FTMRH_EEPROT_DPS_MASK)
#define FTMRH_EEPROT_DPOPEN_MASK                 (0x80U)
#define FTMRH_EEPROT_DPOPEN_SHIFT                (7U)
#define FTMRH_EEPROT_DPOPEN(x)                   (((uint8_t)(((uint8_t)(x)) << FTMRH_EEPROT_DPOPEN_SHIFT)) & FTMRH_EEPROT_DPOPEN_MASK)

