RIOT-OS/RIOT/cpu/kinetis/include/vendor/MKE02Z4.h
/*! @name PUEL - Port Pullup Enable Low Register */
#define PORT_PUEL_PTAPE0_MASK                    (0x1U)
#define PORT_PUEL_PTAPE0_SHIFT                   (0U)
#define PORT_PUEL_PTAPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE0_SHIFT)) & PORT_PUEL_PTAPE0_MASK)
#define PORT_PUEL_PTAPE1_MASK                    (0x2U)
#define PORT_PUEL_PTAPE1_SHIFT                   (1U)
#define PORT_PUEL_PTAPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE1_SHIFT)) & PORT_PUEL_PTAPE1_MASK)
#define PORT_PUEL_PTAPE2_MASK                    (0x4U)
#define PORT_PUEL_PTAPE2_SHIFT                   (2U)
#define PORT_PUEL_PTAPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE2_SHIFT)) & PORT_PUEL_PTAPE2_MASK)
#define PORT_PUEL_PTAPE3_MASK                    (0x8U)
#define PORT_PUEL_PTAPE3_SHIFT                   (3U)
#define PORT_PUEL_PTAPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE3_SHIFT)) & PORT_PUEL_PTAPE3_MASK)
#define PORT_PUEL_PTAPE4_MASK                    (0x10U)
#define PORT_PUEL_PTAPE4_SHIFT                   (4U)
#define PORT_PUEL_PTAPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE4_SHIFT)) & PORT_PUEL_PTAPE4_MASK)
#define PORT_PUEL_PTAPE5_MASK                    (0x20U)
#define PORT_PUEL_PTAPE5_SHIFT                   (5U)
#define PORT_PUEL_PTAPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE5_SHIFT)) & PORT_PUEL_PTAPE5_MASK)
#define PORT_PUEL_PTAPE6_MASK                    (0x40U)
#define PORT_PUEL_PTAPE6_SHIFT                   (6U)
#define PORT_PUEL_PTAPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE6_SHIFT)) & PORT_PUEL_PTAPE6_MASK)
#define PORT_PUEL_PTAPE7_MASK                    (0x80U)
#define PORT_PUEL_PTAPE7_SHIFT                   (7U)
#define PORT_PUEL_PTAPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTAPE7_SHIFT)) & PORT_PUEL_PTAPE7_MASK)
#define PORT_PUEL_PTBPE0_MASK                    (0x100U)
#define PORT_PUEL_PTBPE0_SHIFT                   (8U)
#define PORT_PUEL_PTBPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE0_SHIFT)) & PORT_PUEL_PTBPE0_MASK)
#define PORT_PUEL_PTBPE1_MASK                    (0x200U)
#define PORT_PUEL_PTBPE1_SHIFT                   (9U)
#define PORT_PUEL_PTBPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE1_SHIFT)) & PORT_PUEL_PTBPE1_MASK)
#define PORT_PUEL_PTBPE2_MASK                    (0x400U)
#define PORT_PUEL_PTBPE2_SHIFT                   (10U)
#define PORT_PUEL_PTBPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE2_SHIFT)) & PORT_PUEL_PTBPE2_MASK)
#define PORT_PUEL_PTBPE3_MASK                    (0x800U)
#define PORT_PUEL_PTBPE3_SHIFT                   (11U)
#define PORT_PUEL_PTBPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE3_SHIFT)) & PORT_PUEL_PTBPE3_MASK)
#define PORT_PUEL_PTBPE4_MASK                    (0x1000U)
#define PORT_PUEL_PTBPE4_SHIFT                   (12U)
#define PORT_PUEL_PTBPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE4_SHIFT)) & PORT_PUEL_PTBPE4_MASK)
#define PORT_PUEL_PTBPE5_MASK                    (0x2000U)
#define PORT_PUEL_PTBPE5_SHIFT                   (13U)
#define PORT_PUEL_PTBPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE5_SHIFT)) & PORT_PUEL_PTBPE5_MASK)
#define PORT_PUEL_PTBPE6_MASK                    (0x4000U)
#define PORT_PUEL_PTBPE6_SHIFT                   (14U)
#define PORT_PUEL_PTBPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE6_SHIFT)) & PORT_PUEL_PTBPE6_MASK)
#define PORT_PUEL_PTBPE7_MASK                    (0x8000U)
#define PORT_PUEL_PTBPE7_SHIFT                   (15U)
#define PORT_PUEL_PTBPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTBPE7_SHIFT)) & PORT_PUEL_PTBPE7_MASK)
#define PORT_PUEL_PTCPE0_MASK                    (0x10000U)
#define PORT_PUEL_PTCPE0_SHIFT                   (16U)
#define PORT_PUEL_PTCPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE0_SHIFT)) & PORT_PUEL_PTCPE0_MASK)
#define PORT_PUEL_PTCPE1_MASK                    (0x20000U)
#define PORT_PUEL_PTCPE1_SHIFT                   (17U)
#define PORT_PUEL_PTCPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE1_SHIFT)) & PORT_PUEL_PTCPE1_MASK)
#define PORT_PUEL_PTCPE2_MASK                    (0x40000U)
#define PORT_PUEL_PTCPE2_SHIFT                   (18U)
#define PORT_PUEL_PTCPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE2_SHIFT)) & PORT_PUEL_PTCPE2_MASK)
#define PORT_PUEL_PTCPE3_MASK                    (0x80000U)
#define PORT_PUEL_PTCPE3_SHIFT                   (19U)
#define PORT_PUEL_PTCPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE3_SHIFT)) & PORT_PUEL_PTCPE3_MASK)
#define PORT_PUEL_PTCPE4_MASK                    (0x100000U)
#define PORT_PUEL_PTCPE4_SHIFT                   (20U)
#define PORT_PUEL_PTCPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE4_SHIFT)) & PORT_PUEL_PTCPE4_MASK)
#define PORT_PUEL_PTCPE5_MASK                    (0x200000U)
#define PORT_PUEL_PTCPE5_SHIFT                   (21U)
#define PORT_PUEL_PTCPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE5_SHIFT)) & PORT_PUEL_PTCPE5_MASK)
#define PORT_PUEL_PTCPE6_MASK                    (0x400000U)
#define PORT_PUEL_PTCPE6_SHIFT                   (22U)
#define PORT_PUEL_PTCPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE6_SHIFT)) & PORT_PUEL_PTCPE6_MASK)
#define PORT_PUEL_PTCPE7_MASK                    (0x800000U)
#define PORT_PUEL_PTCPE7_SHIFT                   (23U)
#define PORT_PUEL_PTCPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTCPE7_SHIFT)) & PORT_PUEL_PTCPE7_MASK)
#define PORT_PUEL_PTDPE0_MASK                    (0x1000000U)
#define PORT_PUEL_PTDPE0_SHIFT                   (24U)
#define PORT_PUEL_PTDPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE0_SHIFT)) & PORT_PUEL_PTDPE0_MASK)
#define PORT_PUEL_PTDPE1_MASK                    (0x2000000U)
#define PORT_PUEL_PTDPE1_SHIFT                   (25U)
#define PORT_PUEL_PTDPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE1_SHIFT)) & PORT_PUEL_PTDPE1_MASK)
#define PORT_PUEL_PTDPE2_MASK                    (0x4000000U)
#define PORT_PUEL_PTDPE2_SHIFT                   (26U)
#define PORT_PUEL_PTDPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE2_SHIFT)) & PORT_PUEL_PTDPE2_MASK)
#define PORT_PUEL_PTDPE3_MASK                    (0x8000000U)
#define PORT_PUEL_PTDPE3_SHIFT                   (27U)
#define PORT_PUEL_PTDPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE3_SHIFT)) & PORT_PUEL_PTDPE3_MASK)
#define PORT_PUEL_PTDPE4_MASK                    (0x10000000U)
#define PORT_PUEL_PTDPE4_SHIFT                   (28U)
#define PORT_PUEL_PTDPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE4_SHIFT)) & PORT_PUEL_PTDPE4_MASK)
#define PORT_PUEL_PTDPE5_MASK                    (0x20000000U)
#define PORT_PUEL_PTDPE5_SHIFT                   (29U)
#define PORT_PUEL_PTDPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE5_SHIFT)) & PORT_PUEL_PTDPE5_MASK)
#define PORT_PUEL_PTDPE6_MASK                    (0x40000000U)
#define PORT_PUEL_PTDPE6_SHIFT                   (30U)
#define PORT_PUEL_PTDPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE6_SHIFT)) & PORT_PUEL_PTDPE6_MASK)
#define PORT_PUEL_PTDPE7_MASK                    (0x80000000U)
#define PORT_PUEL_PTDPE7_SHIFT                   (31U)
#define PORT_PUEL_PTDPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEL_PTDPE7_SHIFT)) & PORT_PUEL_PTDPE7_MASK)

/*! @name PUEH - Port Pullup Enable High Register */
#define PORT_PUEH_PTEPE0_MASK                    (0x1U)
#define PORT_PUEH_PTEPE0_SHIFT                   (0U)
#define PORT_PUEH_PTEPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE0_SHIFT)) & PORT_PUEH_PTEPE0_MASK)
#define PORT_PUEH_PTEPE1_MASK                    (0x2U)
#define PORT_PUEH_PTEPE1_SHIFT                   (1U)
#define PORT_PUEH_PTEPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE1_SHIFT)) & PORT_PUEH_PTEPE1_MASK)
#define PORT_PUEH_PTEPE2_MASK                    (0x4U)
#define PORT_PUEH_PTEPE2_SHIFT                   (2U)
#define PORT_PUEH_PTEPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE2_SHIFT)) & PORT_PUEH_PTEPE2_MASK)
#define PORT_PUEH_PTEPE3_MASK                    (0x8U)
#define PORT_PUEH_PTEPE3_SHIFT                   (3U)
#define PORT_PUEH_PTEPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE3_SHIFT)) & PORT_PUEH_PTEPE3_MASK)
#define PORT_PUEH_PTEPE4_MASK                    (0x10U)
#define PORT_PUEH_PTEPE4_SHIFT                   (4U)
#define PORT_PUEH_PTEPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE4_SHIFT)) & PORT_PUEH_PTEPE4_MASK)
#define PORT_PUEH_PTEPE5_MASK                    (0x20U)
#define PORT_PUEH_PTEPE5_SHIFT                   (5U)
#define PORT_PUEH_PTEPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE5_SHIFT)) & PORT_PUEH_PTEPE5_MASK)
#define PORT_PUEH_PTEPE6_MASK                    (0x40U)
#define PORT_PUEH_PTEPE6_SHIFT                   (6U)
#define PORT_PUEH_PTEPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE6_SHIFT)) & PORT_PUEH_PTEPE6_MASK)
#define PORT_PUEH_PTEPE7_MASK                    (0x80U)
#define PORT_PUEH_PTEPE7_SHIFT                   (7U)
#define PORT_PUEH_PTEPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTEPE7_SHIFT)) & PORT_PUEH_PTEPE7_MASK)
#define PORT_PUEH_PTFPE0_MASK                    (0x100U)
#define PORT_PUEH_PTFPE0_SHIFT                   (8U)
#define PORT_PUEH_PTFPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE0_SHIFT)) & PORT_PUEH_PTFPE0_MASK)
#define PORT_PUEH_PTFPE1_MASK                    (0x200U)
#define PORT_PUEH_PTFPE1_SHIFT                   (9U)
#define PORT_PUEH_PTFPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE1_SHIFT)) & PORT_PUEH_PTFPE1_MASK)
#define PORT_PUEH_PTFPE2_MASK                    (0x400U)
#define PORT_PUEH_PTFPE2_SHIFT                   (10U)
#define PORT_PUEH_PTFPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE2_SHIFT)) & PORT_PUEH_PTFPE2_MASK)
#define PORT_PUEH_PTFPE3_MASK                    (0x800U)
#define PORT_PUEH_PTFPE3_SHIFT                   (11U)
#define PORT_PUEH_PTFPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE3_SHIFT)) & PORT_PUEH_PTFPE3_MASK)
#define PORT_PUEH_PTFPE4_MASK                    (0x1000U)
#define PORT_PUEH_PTFPE4_SHIFT                   (12U)
#define PORT_PUEH_PTFPE4(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE4_SHIFT)) & PORT_PUEH_PTFPE4_MASK)
#define PORT_PUEH_PTFPE5_MASK                    (0x2000U)
#define PORT_PUEH_PTFPE5_SHIFT                   (13U)
#define PORT_PUEH_PTFPE5(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE5_SHIFT)) & PORT_PUEH_PTFPE5_MASK)
#define PORT_PUEH_PTFPE6_MASK                    (0x4000U)
#define PORT_PUEH_PTFPE6_SHIFT                   (14U)
#define PORT_PUEH_PTFPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE6_SHIFT)) & PORT_PUEH_PTFPE6_MASK)
#define PORT_PUEH_PTFPE7_MASK                    (0x8000U)
#define PORT_PUEH_PTFPE7_SHIFT                   (15U)
#define PORT_PUEH_PTFPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTFPE7_SHIFT)) & PORT_PUEH_PTFPE7_MASK)
#define PORT_PUEH_PTGPE0_MASK                    (0x10000U)
#define PORT_PUEH_PTGPE0_SHIFT                   (16U)
#define PORT_PUEH_PTGPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTGPE0_SHIFT)) & PORT_PUEH_PTGPE0_MASK)
#define PORT_PUEH_PTGPE1_MASK                    (0x20000U)
#define PORT_PUEH_PTGPE1_SHIFT                   (17U)
#define PORT_PUEH_PTGPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTGPE1_SHIFT)) & PORT_PUEH_PTGPE1_MASK)
#define PORT_PUEH_PTGPE2_MASK                    (0x40000U)
#define PORT_PUEH_PTGPE2_SHIFT                   (18U)
#define PORT_PUEH_PTGPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTGPE2_SHIFT)) & PORT_PUEH_PTGPE2_MASK)
#define PORT_PUEH_PTGPE3_MASK                    (0x80000U)
#define PORT_PUEH_PTGPE3_SHIFT                   (19U)
#define PORT_PUEH_PTGPE3(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTGPE3_SHIFT)) & PORT_PUEH_PTGPE3_MASK)
#define PORT_PUEH_PTHPE0_MASK                    (0x1000000U)
#define PORT_PUEH_PTHPE0_SHIFT                   (24U)
#define PORT_PUEH_PTHPE0(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTHPE0_SHIFT)) & PORT_PUEH_PTHPE0_MASK)
#define PORT_PUEH_PTHPE1_MASK                    (0x2000000U)
#define PORT_PUEH_PTHPE1_SHIFT                   (25U)
#define PORT_PUEH_PTHPE1(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTHPE1_SHIFT)) & PORT_PUEH_PTHPE1_MASK)
#define PORT_PUEH_PTHPE2_MASK                    (0x4000000U)
#define PORT_PUEH_PTHPE2_SHIFT                   (26U)
#define PORT_PUEH_PTHPE2(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTHPE2_SHIFT)) & PORT_PUEH_PTHPE2_MASK)
#define PORT_PUEH_PTHPE6_MASK                    (0x40000000U)
#define PORT_PUEH_PTHPE6_SHIFT                   (30U)
#define PORT_PUEH_PTHPE6(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTHPE6_SHIFT)) & PORT_PUEH_PTHPE6_MASK)
#define PORT_PUEH_PTHPE7_MASK                    (0x80000000U)
#define PORT_PUEH_PTHPE7_SHIFT                   (31U)
#define PORT_PUEH_PTHPE7(x)                      (((uint32_t)(((uint32_t)(x)) << PORT_PUEH_PTHPE7_SHIFT)) & PORT_PUEH_PTHPE7_MASK)

/*! @name HDRVE - Port High Drive Enable Register */
#define PORT_HDRVE_PTB4_MASK                     (0x1U)
#define PORT_HDRVE_PTB4_SHIFT                    (0U)
#define PORT_HDRVE_PTB4(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTB4_SHIFT)) & PORT_HDRVE_PTB4_MASK)
#define PORT_HDRVE_PTB5_MASK                     (0x2U)
#define PORT_HDRVE_PTB5_SHIFT                    (1U)
#define PORT_HDRVE_PTB5(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTB5_SHIFT)) & PORT_HDRVE_PTB5_MASK)
#define PORT_HDRVE_PTD0_MASK                     (0x4U)
#define PORT_HDRVE_PTD0_SHIFT                    (2U)
#define PORT_HDRVE_PTD0(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTD0_SHIFT)) & PORT_HDRVE_PTD0_MASK)
#define PORT_HDRVE_PTD1_MASK                     (0x8U)
#define PORT_HDRVE_PTD1_SHIFT                    (3U)
#define PORT_HDRVE_PTD1(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTD1_SHIFT)) & PORT_HDRVE_PTD1_MASK)
#define PORT_HDRVE_PTE0_MASK                     (0x10U)
#define PORT_HDRVE_PTE0_SHIFT                    (4U)
#define PORT_HDRVE_PTE0(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTE0_SHIFT)) & PORT_HDRVE_PTE0_MASK)
#define PORT_HDRVE_PTE1_MASK                     (0x20U)
#define PORT_HDRVE_PTE1_SHIFT                    (5U)
#define PORT_HDRVE_PTE1(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTE1_SHIFT)) & PORT_HDRVE_PTE1_MASK)
#define PORT_HDRVE_PTH0_MASK                     (0x40U)
#define PORT_HDRVE_PTH0_SHIFT                    (6U)
#define PORT_HDRVE_PTH0(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTH0_SHIFT)) & PORT_HDRVE_PTH0_MASK)
#define PORT_HDRVE_PTH1_MASK                     (0x80U)
#define PORT_HDRVE_PTH1_SHIFT                    (7U)
#define PORT_HDRVE_PTH1(x)                       (((uint32_t)(((uint32_t)(x)) << PORT_HDRVE_PTH1_SHIFT)) & PORT_HDRVE_PTH1_MASK)


/*!
 * @}
 */ /* end of group PORT_Register_Masks */


